[
  {
    "title": "Muhammad and the Biblical Tests of Prophethood",
    "summary": "Examines whether Muhammad satisfies the biblical standards for a true prophet, including doctrinal fidelity to earlier revelation and the call to point people back to Israel’s God.",
    "category": "Scripture & Authority",
    "difficulty": 4,
    "estimatedMinutes": 18,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "True prophets confirm earlier revelation, exalt the God of Abraham, and never preach messages that contradict the Torah and Gospel; Muhammad’s teachings must be weighed by those criteria.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "If Muhammad corrects corrupted Scripture, then deviations from the Bible are justified, and biblical tests cannot be applied to him.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Deuteronomy 13 warns that even miracle-working prophets must be rejected if they lure Israel to another god; Galatians 1:8 rejects later gospels that differ from the apostolic message, so teachings that demote Jesus or rewrite salvation fail the test.",
        "order": 3
      }
    ]
  },
  {
    "title": "Is the Gospel of Barnabas Trustworthy?",
    "summary": "Analyzes the late medieval Gospel of Barnabas often cited by Muslim apologists, assessing its historical credibility and doctrinal conformity to Scripture.",
    "category": "Scripture & Authority",
    "difficulty": 3,
    "estimatedMinutes": 14,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Because the Gospel of Barnabas contradicts first-century testimony and appears centuries after the apostles, it cannot overturn the canonical witness about Jesus’ deity and crucifixion.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Since early Christians allegedly tampered with Scripture, a late gospel that agrees with Islamic claims should be preferred over corrupt canonical texts.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Luke 1:1–4 and 2 Peter 1:16–21 appeal to eyewitnesses, while Jude 3 exhorts believers to guard the faith once delivered—a standard the Barnabas text fails because it rewrites salvation history without apostolic backing.",
        "order": 3
      }
    ]
  },
  {
    "title": "Did Jesus Promise Ahmad?",
    "summary": "Evaluates the Muslim assertion that Jesus foretold Ahmad (Muhammad) in John 14–16, contrasting the Paraclete’s description with the Holy Spirit’s ministry.",
    "category": "Trinity",
    "difficulty": 4,
    "estimatedMinutes": 16,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Jesus promised the Holy Spirit, not another human prophet; the Paraclete would dwell within believers, remind them of Christ’s teaching, and glorify the Son.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "The Greek term parakletos was allegedly altered from periklytos, meaning ‘praised one,’ so the passages refer to Muhammad.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "John 14:16–17 states the Paraclete abides forever and lives in believers, and John 16:14 stresses He glorifies Jesus—actions that only the Holy Spirit fulfills and that Muhammad never claimed for himself.",
        "order": 3
      }
    ]
  },
  {
    "title": "The Sonship of Christ vs. Islamic Misconceptions",
    "summary": "Clarifies the biblical meaning of Jesus being the Son of God and responds to assertions that the phrase implies biological offspring or polytheism.",
    "category": "Trinity",
    "difficulty": 2,
    "estimatedMinutes": 12,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Sonship language reveals Jesus’ unique relationship and shared nature with the Father, not physical procreation; it anchors Christian confession of the Trinity.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Calling Jesus God’s Son assigns a consort to God or splits His unity, proving Christian theology is pagan and incoherent.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "John 1:18 declares the Son reveals the unseen God, and Hebrews 1:3 says He is the radiance of God’s glory—statements about shared essence, which sit comfortably within monotheistic worship.",
        "order": 3
      }
    ]
  },
  {
    "title": "Crucifixion Witnesses and the Qur’anic Denial",
    "summary": "Explores historical and biblical evidence for Jesus’ crucifixion while engaging with Qur’anic passages that claim He was not executed.",
    "category": "Salvation",
    "difficulty": 3,
    "estimatedMinutes": 15,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Multiple independent witnesses—Jewish, Roman, and Christian—attest to the crucifixion, making it the best-attested event in antiquity and central to redemption.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Qur’an 4:157 states that people only thought Jesus was crucified, so apparent evidence merely reflects divine deception or substitution.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Mark 15, 1 Corinthians 15:3–4, and extra-biblical sources like Tacitus converge on the crucifixion; Isaiah 53 already foretold the Servant’s death for sin, rooting salvation in a real sacrifice.",
        "order": 3
      }
    ]
  },
  {
    "title": "Original Sin and Human Accountability",
    "summary": "Contrasts the biblical doctrine of inherited sin with Islamic claims that humans are born morally neutral and need no atonement.",
    "category": "Salvation",
    "difficulty": 3,
    "estimatedMinutes": 13,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Adam’s fall introduced corruption and death to all humanity, requiring divine intervention through Christ’s righteousness.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Each person bears only their own deeds; inherited guilt contradicts divine justice and makes repentance sufficient for wiping sin.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Romans 5:12–19 links Adam’s trespass to universal death and Christ’s obedience to justification, while Psalm 51:5 confesses sinfulness from conception, demonstrating the need for redemption beyond human effort.",
        "order": 3
      }
    ]
  },
  {
    "title": "Law and Gospel in the Life of Jesus",
    "summary": "Shows how Jesus fulfilled the Mosaic Law without abolishing it, countering arguments that Christians inconsistently apply biblical commands.",
    "category": "Law & Grace",
    "difficulty": 2,
    "estimatedMinutes": 11,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Ceremonial shadows pointed to Christ, while moral law reflects God’s character; believers uphold the law through Spirit-led obedience, not legalism.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "If Jesus abolished the law, Christians cherry-pick commands, proving the Bible is inconsistent and unreliable for moral guidance.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Matthew 5:17–19 affirms Jesus fulfilled the Law, and Romans 8:3–4 explains the Spirit empowers believers to meet its righteous requirements, preserving continuity without reverting to the old covenant system.",
        "order": 3
      }
    ]
  },
  {
    "title": "Abraham’s Seed: Israel and the Church",
    "summary": "Discusses continuity and distinction between Israel and the Church in light of God’s promises, addressing Muslim critiques that Christianity abandoned Abrahamic faith.",
    "category": "Israel & the Church",
    "difficulty": 3,
    "estimatedMinutes": 14,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "The Church is grafted into Israel’s promises through Christ, sharing in Abraham’s blessings without erasing ethnic Israel’s future.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Since Jews and Christians corrupted revelation, God replaced them with a new nation centered on Mecca, making Israel’s covenants void.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Romans 11 describes the olive tree analogy where Gentiles are grafted in but warned not to boast, and Galatians 3:29 teaches that those in Christ are Abraham’s seed—unity without supersessionism.",
        "order": 3
      }
    ]
  },
  {
    "title": "Qur’anic View of the Trinity",
    "summary": "Explains the Qur’an’s caricature of the Trinity and clarifies orthodox doctrine to remove stumbling blocks for Muslim readers.",
    "category": "Trinity",
    "difficulty": 3,
    "estimatedMinutes": 12,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "The biblical Trinity is one Being in three coequal Persons; misunderstanding it as a triad of gods or a family unit leads to strawman arguments.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Qur’an 5:116 pictures Christians worshiping a Father, Jesus, and Mary, so the doctrine must be shirk (association of partners with Allah).",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Matthew 28:19 names Father, Son, and Spirit within one baptismal name, and 2 Corinthians 13:14 blesses believers with one God’s tri-personal grace, guarding monotheism while affirming plurality of Persons.",
        "order": 3
      }
    ]
  },
  {
    "title": "Reliability of the New Testament Text",
    "summary": "Responds to claims that the Bible was corrupted before Muhammad, highlighting manuscript evidence and patristic citations.",
    "category": "Scripture & Authority",
    "difficulty": 4,
    "estimatedMinutes": 17,
    "bannerImageUrl": "https://placeimg.com/640/480/arch",
    "sections": [
      {
        "type": "claim",
        "content": "Over 5,000 Greek manuscripts, early translations, and church fathers quoting Scripture allow scholars to reconstruct the original New Testament with high confidence.",
        "order": 1
      },
      {
        "type": "counter",
        "content": "Since the Qur’an accuses Jews and Christians of altering revelation, textual variants in the Bible prove wholesale corruption.",
        "order": 2
      },
      {
        "type": "scripture",
        "content": "Isaiah 40:8 affirms God preserves His word, and Jesus in Matthew 24:35 says His words never pass away; the sheer manuscript witness demonstrates providential preservation rather than disqualifying the text.",
        "order": 3
      }
    ]
  }
]
